app/controllers/blogs_controller.rb

    def index
      blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

    def show
        blog = Blog.find_by(id: params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        blog = Blog.create(blog_params)
---
INSERT INTO "blogs" ("title", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hey"], ["date", nil], ["created_at", "2022-11-30 18:45:18.556452"], ["updated_at", "2022-11-30 18:45:18.556452"]]